#include <iostream>
using namespace std;

int main()
{
    //Задача 14: Ще казваме, че поредица от числа е трион, ако всяко число в нея е едновременно по-голямо или равно от двата си съседа или пък едновременно по-малко или равно от тях. За първия и последния елемент имаме само по един съсед. Напишете програма, която въвежда от стандартния 5 на брой цели числа. Да се изведе на стандартния изход "yes", ако въведената поредица е трион, или "no", в противен случай.
    int a = 0;
    int b = 0;
    int c = 0;
    int d = 0;
    int e = 0;
    cin >> a >> b >> c >> d >> e;
    if ((b >= a && b >= c || b <= a && b <= c) && (c >= b && c >= d || c <= b && c <= d) && (d >= c && d >= e || d <= c && d <= e))
    {
        cout << "yes";
    }
    else 
    {
        cout << "no";
    }

}


