#include <iostream>
using namespace std;

int main()
{
    //Задача 1: Въвежда се цяло число от конзолата. Изведете на конзолата дали числото се дели на 3 без остатък.
    int number = 0;
    cin >> number;
    cout << (number % 3 == 0);

}
    
