#include <iostream>
using namespace std;

int main()
{
     //Задача 4: Създайте програма, която връща дали дадена година е високосна или не.
 
        // Високосна година е такава, деляща се на 4.
        // Ако годината се дели и на 100, то тя не е високосна.
        // Ако годината се дели и на 400, то тя отново е високосна.
    int year = 0;
    cin >> year;
    if ((year % 4 == 0 && year % 100 != 0) || year % 400 == 0)
    {
        cout << "Leap year";
    }
    else
    {
        cout << "Not a leap year";
    }
}