#include <iostream>
using namespace std;

int getOppositeBit(int N, int M) {
    return N ^ (1 << M);
}


int main() {
int N;
int M;
cin >> N >> M;
cout << getOppositeBit(N, M);
//     Задача 3: Да се напише функция, която приема 2 цели числа N и M и връща стойността на числото N с променена стойност на бита на позиция M (отзад напред, започвайки от 0).

// Бонус: да се направи да се подава като параметър стойността на бита, която да се запази

// Пример:

// Вход:

// 5 0 // Обръщаме нулевия (последния) бит на 101 -> 100
// Изход:

// 4 // Вече числото е 100
}